Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ1064DAG176.PIC
      <edc:SFRDef edc:_addr="0x1F8E809C" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="9" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD17" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD17" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80A0" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="10" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD18" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80A4" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="11" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD19" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD19" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80A8" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="12" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD110" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD110" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
