Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ1064DAG176.PIC
      <edc:SFRDef edc:_addr="0x1F8EA5E4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT121" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT121" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA5E8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT122" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT122" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA5EC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT123" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT123" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA5F0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT124" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT124" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA5F4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT125" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT125" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA5F8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT126" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT126" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA5FC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT127" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT127" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
